<template>
  <div>
    <h4>{{title}}</h4>
    <slot></slot>
  </div>
</template>

<script setup lang="ts">
defineProps(['title'])
</script>

<style>

</style>

______________________________________________________________________
Создайте компонент Card, который:
Принимает title через props
Имеет слот для контента
Используется в родительском компоненте так:

<!-- <Card title="Приветствие">
  Добро пожаловать во Vue 3!
</Card> -->

Ожидаемый результат: Карточка с заголовком "Приветствие" и текстом "Добро пожаловать во Vue 3!".