<template>
   <p>Задача 3: "Создать форму с полем ввода пароля"</p>
  <form>
    <input type="text" placeholder="введите пароль">
    
    <button disabled @click="reg" >зарегистрироваться</button>
    
  </form>

</template>

<script setup lang="ts">

const text = ref('')
const reg = () => {
  if(text.value){
 
  }
}

</script>

<style>
</style>
_________________________________________________________________________________________________________________________
Создать форму с полем ввода пароля, требованиями к паролю и кнопкой регистрации, которая по умолчанию отключена (disabled)

Требования: символы в верхнем регистре, символы в нижнем регистре, цифры, минимальная длинна 8 символов

Требования должны визуально показывать, что они выполнены.

Когда выполнены все требования, убираем disabled с кнопки регистрации