<template>
  <p>Задача 2: "Список дел (To-Do List)"</p>
  <div class="view-list">
    <input type="text" placeholder="Дело" v-model="text">
{{ text }}
<br></br>
{{ toDo }}
    <button @click="">Добавить</button>
  </div> 
  <div style="display: flex;">
    <p>Список пуст</p>
    <ol id="toAddList">
      <li></li>
    </ol>
    <button>Удалить</button>  
  </div>
</template>

<script setup lang="ts">
const toDo = ref([])
const text = ref('')


</script>

<style>
.view-list {
  display: flex;
  gap: 10px;
}

</style>
_________________________________________________________________________________________________________________
Задача 2: "Список дел (To-Do List)"

Цель: Работа со списками (v-for), обработка ввода из формы и модификация массива.

Условие:
Создайте простой список дел:

Поле ввода (input) и кнопка "Добавить".

При нажатии на кнопку (или на Enter) текст из поля ввода добавляется в список.

Каждый элемент списка отображается как <ли> и имеет кнопку "Удалить", которая удаляет этот элемент из списка.

Если список пуст, отображается параграф "Список дел пуст".

Вопрос на понимание:

Почему важно назначать уникальный :key для каждого элемента в v-for?

Почему мы не можем напрямую изменять параметр элемента в цикле v-for (например, item.text = 'новый текст')? Что нужно сделать вместо этого?