<template>
<Card title="Приветствие">
  Добро пожаловать во Vue 3!
</Card>
</template>
<script setup lang="ts">


</script>

<style scoped>
.hello {
  background-color: blue;  
  color: aliceblue;
  height: 300px;
}
</style>
______________________________________________________________________
Создайте компонент Card, который:
Принимает title через props
Имеет слот для контента
Используется в родительском компоненте так:

<!-- <Card title="Приветствие">
  Добро пожаловать во Vue 3!
</Card> -->

Ожидаемый результат: Карточка с заголовком "Приветствие" и текстом "Добро пожаловать во Vue 3!".

